// Напишите программу, которая принимает на вход 3 числа и выдает максимальное из этих чисел.

Console.Write("Введите число: ");
int num1 = Convert.ToInt32(Console.ReadLine());
Console.Write("Введите число: ");
int num2 = Convert.ToInt32(Console.ReadLine());
Console.Write("Введите число: ");
int num3 = Convert.ToInt32(Console.ReadLine());
if(num1 > num2);
if(num1 > num3)
{
Console.WriteLine("первое число максимальное");
}
else
if(num3<num2) 
{
Console.WriteLine("второе число максимальное ");
}
else
if(num3>num2)
{
Console.WriteLine("третье число максимальное ");
}
