//Напишите программу, которая на вход принимает число и выдает, является ли оно четным.

Console.Write("Введите число: ");
int num1 = Convert.ToInt32(Console.ReadLine());
if (num1%2==0)
{
 Console.WriteLine("ваше число является чётным");
}